var devlogData = [
    ["21", "8", "2024", [6], "Console Support", "Thanks to a friend, I borrowed his console and developed console support for the game. Currently it's just the left stick for camera and the right stick for the flight controls. More to come later."],
    ["14", "8", "2024", [0, 2], "Minor Update DevLog #2", "The engine power lerping is already implemented. You can see the white line (engine power) which will slowly move to the orange line (input power).\n\nA prototype of the SiTac has also been made. Currently it only has the map working. But I plan to make it able to swap the MFD pages so you can go from radar to SiTac, SPECTRA, etc. It will also be used for the side MFDs so you can open the stores management page, TGP page, engine page, and the fuel page.\n\nThe gear deploy/retract animation has also been implemented. But, it doesn't impact the flight performance (I.E. drag). I will need to add that feature in the future, together with the canopy drag if opened.\n\nBy the way, the devlog page now supports images if you didn't realize yet. It does make the page really long, so I will probably need to make a way to open/collapse the image or the devlog content.", ["14-08-2024-Lerped Engine UI.png", "14-08-2024-SiTac Prototype.png", "14-08-2024-Gear Demonstration.png"]],
    ["22", "7", "2024", [0], "Minor Update DevLog #1", "I have just implemented an engine system that is affected by your airspeed and soon by your altitude. Aside from that, I have also made an experimental afterburner system, I will only need to apply better textures. I will also model the nozzle opening and make it so that the power of the engine lerps and not jump (which should also be visible in the UI)."],
    ["4", "7", "2024", [0], "Custom Loadout is here!", "Now, by pressing L, you can open the loadout window and customize your loadout. Make your sortie more effective with this tool\n\nNow I'm just gonna copy the devblog from the YouTube update (<a href='https://youtu.be/Zp4b3WNFaog'>here</a>)\n\nI also added a few QoL updates like the scope range of the sensors. Though, due to how small the map is, it's mostly useless\n\nI modified the flight model to add more drag, but I think it is too excessive. I'll tweak it later\n\nI also found some documents regarding the M88 engine, so next update will be engine and fuel update\n\nAside from that, I also wanted to experiment with MFD pages. I'll add the SiTac (Situation Tactique) to the HLD also in the next update. It should be something cool\n\nNot only that, A-A missiles should also be worked upon. Well, more like general missiles since as seen in footages the AASM is really weird when firing lol. Missiles should now utilize actual wings to steer themselves. Sounds difficult but it'll be worth it\n\nUtilizing the new A-A missile, I'll make the SA-2 site come to live. I'll model the SNR-75 radar. And since there's a new Radar Emitter on the scene, I can now make a working RWR\n\nTL:DR; next update should be about SiTac, RWR, missile guidance rework, and a proper Snecma M88 engine and fuel system"],
    ["4", "7", "2024", [2], "Fighting Hawk website is on air!", "This website will contain infos and mostly devblogs"],
];

var devlogCategories = ["Updates", "Development", "Website", "Plans", "Miscellaneous", "New Stuffs", "Roadmap"];